Repository: ga8ert/wtho
Catalog: lib/l10n/app_*.arb
Languages: uk

source: Hello
uk: Привіт

# welcome
source: Welcome to our app!
uk: Ласкаво просимо до нашого застосунку!

source: Log out
uk: Вийти

source: Log in
uk: Увійти

source: Sign Up
uk: Створити акаунт

source: Email
uk: Електронна пошта

source: Password
uk: Пароль

source: Settings
uk: Налаштування

source: Language
uk: Мова

source: Confirm
uk: Підтвердити

source: Cancel
uk: Скасувати

# logo1
source: WHO TO
uk: З КИМ

# logo2
source: HANG OUT
uk: ЗАТУСИТИ

source: Log in with Email
uk: Увійти за допомогою пошти

source: Sign in with Facebook
uk: Увійти за допомогою Facebook

source: Name
uk: Імʼя

source: Surname
uk: Прізвище

source: Age
uk: Вік

source: City
uk: Місто

source: Registration
uk: Реєстрація

source: Registration Success!
uk: Реєстрація успішна!

source: Groups nearby
uk: Групи поруч

source: Profile
uk: Профіль

source: Email Verification Sent
uk: Верифікацію відправленно на пошту!

source: Please Verify Email
uk: Будь ласка, верифікуйте пошту!

source: Take a photo
uk: Зробити фото

source: Choose from gallery
uk: Вибрати з галереї

source: Ok
uk: Ок

source: Error
uk: Помилка

source: Confirm email
uk: Підтвердіть email

# please_confirm_email
source: Please confirm your email using the link in the email. After confirming, click - I confirmed.
uk: Будь ласка, підтвердіть email за посиланням у листі. Після підтвердження натисніть - Я підтвердив.

# email_not_yet_confirmed
source: Email not confirmed yet!
uk: Email ще не підтверджено!

source: I confirmed
uk: Я підтвердив

# letter_has_been_sent
source: The letter has been sent!
uk: Лист повторно надіслано!

source: Send a letter
uk: Надіслати лист

source: Join request sent!
uk: Запит на приєднання надіслано!

source: Description missing
uk: Опис відсутній

source: Participants
uk: Учасники

source: Originator
uk: Ініціатор

source: Join requests
uk: Запити на приєднання

source: Get directions
uk: Прокласти маршрут

source: Sending
uk: Відправка

source: Invite to join the event
uk: Запросити приєднання до події

source: Go to chat
uk: Перейти у чат

source: Events
uk: Івенти

source: Friends
uk: Друзі

source: No events
uk: Немає івентів

# no_data
source: No data to display
uk: Немає даних для відображення

source: km
uk: км

# please_confirm_email_before_login
source: Please confirm your email before logging in.
uk: Будь ласка, підтвердіть email перед входом.

# email_not_verified
source: Email is not verified yet.
uk: Email ще не підтверджено.

# email_verification_error
source: Email verification error: {error}
uk: Помилка перевірки email: {error}

# email_send_error
source: Failed to send email: {error}
uk: Не вдалося надіслати лист: {error}

# fill_all_required_fields
source: Please fill in all required fields.
uk: Заповніть всі обовʼязкові поля

# error_with_message
source: Error: {error}
uk: Помилка: {error}

source: Create event
uk: Створити івент

source: Title
uk: Заголовок

source: Place
uk: Місце

source: Offline
uk: Офлайн

source: Online
uk: Онлайн

source: Hybrid
uk: Гібрид

source: Meeting type
uk: Тип зустрічі

# map_point_selected
source: Map point: {lat}, {lng}
uk: Точка на карті: {lat}, {lng}

source: Map point not selected
uk: Точка на карті не вибрана

source: Select on map
uk: Вибрати на карті

source: Start: {time}
uk: Початок: {time}

# select_start_time
source: Select start date and time
uk: Оберіть дату та час початку

source: Done
uk: Готово

source: Select
uk: Вибрати

source: End: {time}
uk: Кінець: {time}

# select_end_time
source: Select end date and time
uk: Оберіть дату та час завершення

# users_added
source: Users added: {count}
uk: Додано користувачів: {count}

source: No users selected
uk: Користувачі не вибрані

source: Add users
uk: Додати користувачів

# chat_not_implemented
source: Chat is not implemented yet
uk: Чат ще не реалізовано

source: Description
uk: Опис

source: Failed to get uid
uk: Не вдалося отримати uid

source: Event created!
uk: Івент створено!

source: Determining location...
uk: Визначаємо локацію...

source: Location unavailable
uk: Локація недоступна

source: Add
uk: Додати

source: Decline
uk: Відхилити

source: Select point on map
uk: Виберіть точку на карті

source: Select friends
uk: Виберіть друзів

# no_friends
source: You have no friends
uk: У вас немає друзів

source: No name
uk: Без імені

source: Ukrainian
uk: Українська

source: English
uk: Англійська

source: Delete Account
uk: Видалити акаунт

# delete_account_confirm
source: Are you sure you want to delete your account? This action cannot be undone.
uk: Ви впевнені, що хочете видалити акаунт? Цю дію не можна скасувати.

source: No friends yet.
uk: Немає друзів.

source: No users found.
uk: Користувачів не знайдено.

source: Search by nickname
uk: Пошук по нікнейму

source: Nickname
uk: Нікнейм

# nickname_too_short
source: Nickname must be at least 4 characters
uk: Нікнейм має містити щонайменше 4 символи

# nickname_taken
source: Nickname already taken
uk: Нікнейм вже зайнятий

# registration_success_check_email
source: Registration successful! Please check your email.
uk: Реєстрація успішна! Перевірте вашу пошту.

source: Friend request sent
uk: Запит надіслано

# event_type_social_bar
source: Bar hangout
uk: Тусимо в барі

# event_type_social_hangout
source: Just hang out
uk: Просто потусити

# event_type_social_neighbors
source: Neighbors meetup
uk: Сусіди ЖК

# event_type_social_coffee
source: Go for coffee
uk: Вийти на каву

# event_type_social_newcomers
source: Newcomers in the city
uk: Зустріч новачків у місті

# event_type_social_introverts
source: Introverts gathering
uk: Сходка інтровертів

# event_type_social_movie_pizza
source: Movie & pizza night
uk: Ніч кіно і піци

# event_type_social_memes_tea
source: Memes & tea evening
uk: Вечір мемів і чаю

# event_type_social_talk
source: Just talk
uk: Просто поговорити

# event_type_social_relax
source: Afterwork relax
uk: Релакс після роботи

# event_type_sport_company
source: Company for sports
uk: Компанія для спорту

# event_type_sport_play
source: Let's play something
uk: Зіграємо щось

# event_type_sport_gym
source: Going to the gym — join me?
uk: Іду в спортзал — хто зі мною?

# event_type_sport_morning
source: Morning workout
uk: Зарядка на світанку

# event_type_sport_trip
source: Mini day trip
uk: Міні-подорож на день

# event_type_sport_beach
source: Beach / river day
uk: На пляж / до річки

# event_type_sport_dog
source: Walk the dog
uk: Погуляти з собакою

# event_type_sport_cafe
source: Trying a new cafe
uk: Тестимо нове кафе

# event_type_games_board
source: Board games in park/cafe
uk: Настолки в парку / кафе

# event_type_games_night
source: Game night / PlayStation
uk: Ігрова ніч / PlayStation

# event_type_games_standup
source: Comedy room / standup
uk: Кімната сміху / стендап

# event_type_games_karaoke
source: Karaoke night
uk: Караоке-вечір

# event_type_games_cook
source: Cooking together
uk: Готуємо щось разом

# event_type_games_creative
source: Creative meetup
uk: Творча сходка

# event_type_games_language
source: Language tandem
uk: Мовний тандем

# event_type_games_quest
source: Quest / bowling / VR
uk: Квест / боулінг / VR

# event_type_chill_picnic
source: Picnic for no reason
uk: Пікнік без приводу

# event_type_chill_yard
source: Chill in the yard/roof
uk: Чіл у дворі / на даху

# event_type_chill_morning_coffee
source: Morning coffee before work
uk: Ранкова кава перед роботою

# event_type_chill_blanket
source: Blanket & thermos hangout
uk: Тусовка з пледами і термосами

source: Filters
uk: Фільтри

# radius
source: Radius (km)
uk: Радіус (км)

# reset_filters
source: Reset
uk: Скинути

# event_type_other
source: Other
uk: Інше

source: Who am I with?
uk: З ким я зараз?

source: Save
uk: Зберегти

source: Failed to save
uk: Не вдалося зберегти

source: Failed to load friends
uk: Не вдалося завантажити друзів

source: No friends found
uk: Друзів не знайдено

source: My events
uk: Мої івенти

source: Joined events
uk: Приєднані івенти

# chat_expiry
source: Chat will be available for {days} more days after the event ends.
uk: Чат буде доступний ще {days} днів після завершення івенту.

# chat_expired
source: Chat expired and will be deleted soon.
uk: Чат завершився і скоро буде видалений.

# chat_input_hint
source: Type a message...
uk: Введіть повідомлення...

# no_chat_id_for_event
source: No chatId for this event!
uk: Немає chatId для цього івенту!

source: Add photo
uk: Додати фото

source: Support Us
uk: Підтримати нас

# support_us_title
source: Support our project!
uk: Підтримайте наш проєкт!

# support_us_body
source: If you like our app, you can support us and help us grow. Your support motivates us to make the app even better!
uk: Якщо вам подобається наш застосунок, ви можете підтримати нас і допомогти розвиватися. Ваша підтримка мотивує нас робити застосунок ще кращим!

# support_us_action
source: Support
uk: Підтримати

# support_us_thank_you
source: Thank you for your support!
uk: Дякуємо за вашу підтримку!

source: Sign in with Google
uk: Увійти через Google

source: Photo not selected.
uk: Фото не вибрано.

# file_too_large
source: File is too large. Max 8 MB.
uk: Файл занадто великий. Макс 8 МБ.

# file_not_exists
source: File does not exist or path is empty.
uk: Файл не існує або шлях порожній.

source: Failed to upload photo.
uk: Не вдалося завантажити фото.

# error_with_colon
source: Error: {error}
uk: Помилка: {error}

source: Location Permission
uk: Дозвіл на локацію

# location_permission_message
source: To use this feature, please allow location access in the app settings.
uk: Для використання цієї функції, будь ласка, дозвольте доступ до локації в налаштуваннях додатку.

source: Open Settings
uk: Відкрити налаштування

# location_permission_denied
source: Location permission is permanently denied. Please enable it in the app settings.
uk: Дозвіл на локацію назавжди відхилено. Будь ласка, увімкніть його в налаштуваннях додатку.

# with_friends
source: Here you can choose the friends you are currently hanging out with.
uk: Тут ти можеш обрати друзів з якими ви зараз тусите

# event_group_social
source: 🎉 Social / Hangout
uk: 🎉 Соціальні / туса

# event_group_sport
source: 🏃‍♀️ Activity / Sport
uk: 🏃‍♀️ Активність / спорт

# event_group_games
source: 🎲 Board games / Fun
uk: 🎲 Настолки / розваги

# event_group_chill
source: 🌳 Chill
uk: 🌳 Спокійні

# public_chat_title
source: Open chat (anyone can join)
uk: Відкритий чат (може приєднатись будь-хто)

# private_chat_title
source: Private chat (only approved users can join)
uk: Приватний чат (тільки після підтвердження)

# public_chat_subtitle
source: Chat will be available to everyone.
uk: Чат буде доступний для всіх.

# private_chat_subtitle
source: Chat will be available only after approval.
uk: Чат буде доступний лише після підтвердження.

# public_chat_confirm
source: Open chat will be visible to everyone. Are you sure you want to make the chat public?
uk: Відкритий чат буде видимий для всіх. Ви впевнені, що хочете зробити чат публічним?

# edit_profile_title
source: Edit profile
uk: Редагувати профіль

# edit_profile_soon
source: Edit profile coming soon!
uk: Редагування профілю скоро буде доступне!

# edit_profile_ok
source: OK
uk: Гаразд

source: Edit
uk: Редагувати

source: Preview
uk: Перегляд

source: Media
uk: Медіа

source: About Me
uk: Про себе

# about_me_hint
source: Tell something about yourself...
uk: Розкажіть щось про себе...
